# AttachOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment..::..AttachOffset Property
ColumnAttachment Class See Also
---
The offset of the column attachment.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double AttachOffset { get; set; }
```

Visual Basic
---
```text
Public Property AttachOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AttachOffset {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for attachOffset must be no more than 30000 feet in absolute value. |

# See Also
ColumnAttachment Class
Autodesk.Revit.DB Namespace